[
  {
    "id": 0,
    "name": "Cirk",
    "description": "The ultimate hub for highschool campus life, connecting students with committees, events, and campus news. A fully functional app built with Next.js, featuring secure authentication with Lucia, robust data management with Supabase and Drizzle ORM, and deployed on Vercel for optimal performance.",
    "repo": "https://github.com/Emile1515/campus-core",
    "live": "#",
    "tech": ["React", "Vite", "Next.js", "TailwindCSS", "ShadCN", "Supabase", "DrizzeORM", "Node.js", "Lucia", "Typescript", "Vercel"],
    "src": "Cirk_Video.mp4",
    "isVideo": true
  },
  {
    "id": 1,
    "name": "MovieHub",
    "description": "This project combines backend and frontend functionality to create an interactive \"Where's Waldo?\"-style game. Users search for hidden characters in an image, receive feedback, and track their scores.",
    "live": "https://movie-hub-gules.vercel.app/",
    "repo": "https://github.com/vinh2155/MovieHub",
    "tech": ["React", "Vite", "React Router", "LocalStorage", "Node.js","Vercel"],
    "src": "MovieHub_Video.mp4",
    "isVideo": true
  },
  {
    "id": 2,
    "name": "Simple Blockchain",
    "description": "A basic blockchain implementation with REST API endpoints, featuring proof-of-work mining, transaction management, and decentralized node networking. Includes mining rewards, chain validation, and consensus mechanisms for maintaining blockchain integrity across multiple nodes.",
    "repo": "https://github.com/vinh2155/blockchain",
    "tech": ["Python", "Postman", "Flask", "Hashlib", "Requests"],
    "src": "images/blockchain.png"
  },
  {
    "id": 3,
    "name": "Mini Message Board",
    "description": "A minimalist message board application built with Express and EJS, enabling users to post, view, and manage messages. Features include adding new messages, displaying message lists, and basic message management for simple online communication.",
    "live": "https://message-board-hzx0.onrender.com/",
    "repo": "https://github.com/vinh2155/Mini_Message_Board",
    "tech": ["Node.js", "Express", "EJS", "CSS3", "HTML5","Render"],
    "src": "MessageBoard_Video.mp4",
    "isVideo": true
  },
  {
    "id": 4,
    "name": "Diabetes Classification",
    "description": "A comprehensive machine learning project for diabetes classification using the OSEMN data science pipeline. The notebook covers data cleaning and visualization with pandas for data manipulation and matplotlib for graphical exploration. Predictive modeling is performed to identify diabetes presence from patient health metrics, focusing on optimized Logistic Regression and K-Nearest Neighbors (KNN) models, resulting in an accuracy of 77%",
    "repo": "https://github.com/vinh2155/Diabetes-classification",
    "tech": ["Kaggle", "scikit-learn", "Numpy","Pandas", "Matplotlib", "Seaborn"],
    "src": "images/diabete.jpg"
  },
  {
    "id": 5,
    "name": "E-commerce",
    "description": "A linear regression model to forecast e-commerce sales, leveraging advanced data preprocessing, feature selection, and exploratory data analysis on a dataset of 4,000+ records. Utilized pandas and seaborn for in-depth data visualization and trend analysis achieving a RMSE of 10.19 (2.04% of the dataset mean)",
    "repo": "https://github.com/vinh2155/E-commerce-Model",
    "tech": ["Kaggle", "scikit-learn", "Pandas","Scipy", "Matplotlib", "Seaborn"],
    "src": "images/E-commerce.png"
  }
]
